baseCases/baseCaseMass/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

l1  -length1;
l2  length2;
w1  -width;
w2  width;

vertices
(
    ($l1 $w1 $w1)  // 00
    ($l2 $w1 $w1)  // 01
    ($l2 $w2 $w1)  // 02
    ($l1 $w2 $w1)  // 03
    ($l1 $w1 $w2)  // 04
    ($l2 $w1 $w2)  // 05
    ($l2 $w2 $w2)  // 06
    ($l1 $w2 $w2)  // 07
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (nDiscX nDiscYZ nDiscYZ) simpleGrading (1 1 1)
);

// TODO MK: adjust geometry to work as a tube 

boundary
(	
	// -- sides of the geometry
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (7 6 2 3)
            (1 0 3 2)
            (0 1 5 4)
        );
    }
);

// ************************************************************************* //
